satcfdi/pacs/sat_templates/consulta.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <Body>
        <tem:Consulta>
            <tem:expresionImpresa/>
        </tem:Consulta>
    </Body>
</Envelope>